class Helper(object):
    HELP_M = '''دسته‌ای را که نیاز به راهنمایی دارید انتخاب کنید.
سوالات خود را در چت پشتیبانی مطرح کنید

تمام دستورات با / قابل استفاده هستند'''

    HELP_ChatGPT = '''چت جی‌پی‌تی

دستورات چت جی‌پی‌تی:

/ask ➠ از مدل هوش مصنوعی برای دریافت پاسخ سوال شما استعلام می‌کند.
'''

    HELP_Sticker = '''استیکرها

دستورات استیکر:

/packkang ➠ از یک پک استیکر، پک جدید می‌سازد.
/stickerid ➠ شناسه استیکر را دریافت می‌کند.
'''

    HELP_TagAll = '''منشن

دستورات منشن:

✿ نوع منشن را در گروه خود انتخاب کنید ✿

๏ /gmtag ➛ منشن صبح بخیر
برای توقف ⇴ /gmstop

๏ /gntag ➛ منشن شب بخیر
برای توقف ⇴ /gnstop

๏ /tagall ➛ منشن با پیام تصادفی
برای توقف ⇴ /tagoff /tagstop

๏ /hitag ➛ منشن با پیام هندی تصادفی
برای توقف ⇴/histop

๏ /shayari ➛ منشن با شعر تصادفی
برای توقف ⇴ /shstop

๏ /utag ➛ منشن با متن سفارشی
برای توقف ⇴ /cancel 

๏ /vctag ➛ منشن دعوت به چت صوتی
برای توقف ⇴ /vcstop
'''

    HELP_Info = '''اطلاعات

دستورات اطلاعات:

/id : برای دریافت شناسه گروه فعلی. اگر در پاسخ به پیامی استفاده شود، شناسه کاربر را دریافت می‌کند.
/info : برای دریافت اطلاعات کاربر.
/github <نام کاربری> : برای دریافت اطلاعات کاربر گیت‌هاب.
'''

    HELP_Group = '''گروه

دستورات مدیریت گروه:

این دستورات برای مدیریت گروه در دسترس هستند:

⦿ /pin ➠ سنجاق کردن پیام در گروه.
⦿ /pinned ➠ نمایش پیام سنجاق شده در گروه.
⦿ /unpin ➠ برداشتن سنجاق پیام فعلی.
⦿ /staff ➠ نمایش لیست مدیران.
⦿ /bots ➠ نمایش لیست ربات‌های گروه.
⦿ /settitle ➠ تنظیم عنوان گروه.
⦿ /setdiscription ➠ تنظیم توضیحات گروه.
⦿ /setphoto ➠ تنظیم تصویر گروه.
⦿ /removephoto ➠ حذف تصویر گروه.
⦿ /zombies ➠ حذف حساب‌های پاک شده از گروه.
⦿ /imposter روشن/خاموش ➠ روشن یا خاموش کردن نظارت‌گر گروه که کاربران تغییر نام داده را گزارش می‌دهد.
'''

    HELP_Extra = '''اضافی

دستورات اضافی:

⦿ /math ➠ حل مسائل و معادلات ریاضی.
⦿ /blackpink ➠ ایجاد لوگو با سبک بلک‌پینک.
⦿ /carbon ➠ ایجاد تصویر کد کربن از متن برنامه‌نویسی.
⦿ /speedtest ➠ تست سرعت اینترنت.
⦿ /reverse ➠ معکوس کردن متن.
⦿ /webss ➠ گرفتن اسکرین‌شات از وب‌سایت.
⦿ /paste ➠ آپلود متن به کلود و دریافت لینک.
⦿ /tgm ➠ آپلود تصویر (کمتر از 5 مگابایت) به کلود و دریافت لینک.
⦿ /tr ➠ ترجمه متن.
⦿ /google ➠ جستجو در گوگل.
⦿ /stack ➠ جستجوی اطلاعات برنامه‌نویسی در استک‌اورفلو.
'''

    HELP_Image = '''تصاویر

دستورات تصویر:

⦿ /draw ➠ ایجاد نقاشی بر اساس توضیحات.
⦿ /image ➠ جستجوی تصویر بر اساس کلیدواژه.
⦿ /upscale ➠ پاسخ به تصویر برای بهبود کیفیت آن.
'''

    HELP_Action = '''اقدامات

دستورات بن و میوت:

» دستورات موجود برای بن و میوت:

 ❍ /kickme: اخراج کاربری که دستور را صادر کرده

فقط برای مدیران:
 ❍ /ban <شناسه کاربر>: بن کردن کاربر
 ❍ /sban <شناسه کاربر>: بن خاموش کاربر
 ❍ /tban <شناسه کاربر> x(د/س/ی): بن موقت
 ❍ /unban <شناسه کاربر>: رفع بن
 ❍ /kick <شناسه کاربر>: اخراج کاربر
 ❍ /mute <شناسه کاربر>: میوت کردن کاربر
 ❍ /tmute <شناسه کاربر> x(د/س/ی): میوت موقت
 ❍ /unmute <شناسه کاربر>: رفع میوت
'''

    HELP_Search = '''جستجو

دستورات جستجو:

• /google <کوئری> : جستجو در گوگل
• /anime <کوئری> : جستجو در لیست انیمه
• /stack <کوئری> : جستجو در استک‌اورفلو
• /image (/imgs) <کوئری> : جستجوی تصاویر
'''

    HELP_Font = '''فونت‌ها

راهنمای ماژول فونت:

تغییر فونت هر متنی!

◌ /font [متن]
'''

    HELP_Game = '''بازی‌ها

بازی‌های کوچک برای سرگرمی:

◌ /toss [پرتاب سکه]
◌ /roll [پرتاب تاس]
◌ /dart [پرتاب دارت]
◌ /slot [اسلات ماشین]
◌ /bowling [بازی بولینگ]
◌ /basket [بازی بسکتبال]
◌ /football [بازی فوتبال]
'''

    HELP_TG = '''تلگراف

دستورات تلگراف:

ایجاد لینک تلگراف برای هر رسانه‌ای!

◌ /tgm [پاسخ به رسانه]
◌ /tgt [پاسخ به رسانه]
'''

    HELP_Imposter = '''ایمپاستر

ماژول ایمپاستر:

◌ /imposter on
◌ /imposter off
'''

    HELP_TD = '''حقیقت یا جرأت

دستورات حقیقت یا جرأت:

◌ /truth : ارسال سوال حقیقت تصادفی
◌ /dare : ارسال چالش تصادفی
'''

    HELP_HT = '''هشتگ

ماژول هشتگ:

◌ /hastag : [متن]
'''

    HELP_TTS = '''تبدیل متن به گفتار

ماژول تبدیل متن به گفتار:

❀ تبدیل متن به صدا
◌ /tts : [متن]

◌ کاربرد ➛ تبدیل متن به صدا
'''

    HELP_Fun = '''سرگرمی

ماژول سرگرمی:

◌ /wish : آرزوی خود را اضافه کنید و احتمال تحقق آن را ببینید!

دستورات بیشتر:
◌ /sigma [بررسی سطح سیگما]
◌ /cute [بررسی میزان بامزگی]
◌ /horny [بررسی میزان شهوت]
◌ /lesbo [بررسی میزان لزبین بودن]
◌ /depressed [بررسی میزان افسردگی]
◌ /gay [بررسی میزان گی بودن]
◌ /rand [بررسی میزان تصادفی بودن]
◌ /bkl [بررسی میزان بکل]
◌ /boobs [بررسی سایز سینه]
◌ /dick [بررسی سایز آلت]
'''

    HELP_Q = '''نقل قول

ماژول نقل قول:

◌ /q : ایجاد نقل قول از پیام

◌ /q r : ایجاد نقل قول از پیام با پاسخ
'''

    fullpromote = {
        'can_change_info': True,
        'can_post_messages': True,
        'can_edit_messages': True,
        'can_delete_messages': True,
        'can_invite_users': True,
        'can_restrict_members': True,
        'can_pin_messages': True,
        'can_promote_members': True,
        'can_manage_chat': True,
    }

    promoteuser = {
        'can_change_info': False,
        'can_post_messages': True,
        'can_edit_messages': True,
        'can_delete_messages': False,
        'can_invite_users': True,
        'can_restrict_members': False,
        'can_pin_messages': False,
        'can_promote_members': False,
        'can_manage_chat': True,
    }
