HELP_1 = """<b><u>دستورات مدیر:</b></u>

فقط <b>c</b> را در ابتدای دستورات اضافه کنید تا در کانال استفاده شوند.

/pause : توقف موقت پخش فعلی.
/resume : ادامه پخش متوقف شده.
/skip : رد کردن پخش فعلی و شروع پخش آهنگ بعدی در صف.
/end یا /stop : پاک کردن صف و پایان دادن به پخش فعلی.
/player : دریافت پنل پخش تعاملی.
/queue : نمایش لیست آهنگ‌های در صف.
"""

HELP_2 = """
<b><u>کاربران تایید شده:</b></u>

کاربران تایید شده می‌توانند از اختیارات مدیر در ربات استفاده کنند بدون اینکه مدیر گفتگو باشند.

/auth [نام کاربری/شناسه کاربر] : افزودن کاربر به لیست تایید شده‌ها.
/unauth [نام کاربری/شناسه کاربر] : حذف کاربر از لیست تایید شده‌ها.
/authusers : نمایش لیست کاربران تایید شده در گروه.
"""

HELP_3 = """
<u><b>ویژگی پخش همگانی</b></u> [فقط برای توسعه‌دهندگان]:

/broadcast [پیام یا پاسخ به پیام] : پخش پیام به گفتگوهای تحت پوشش ربات.

<u>حالت‌های پخش همگانی:</u>
<b>-pin</b> : سنجاق کردن پیام پخش شده در گفتگوهای تحت پوشش.
<b>-pinloud</b> : سنجاق کردن پیام پخش شده و ارسال اعلان به اعضا.
<b>-user</b> : پخش پیام به کاربرانی که ربات را شروع کرده‌اند.
<b>-assistant</b> : پخش پیام از حساب دستیار ربات.
<b>-nobot</b> : اجبار ربات به عدم پخش پیام.

<b>مثال:</b> <code>/broadcast -user -assistant -pin تست پخش همگانی</code>
"""

HELP_4 = """<u><b>ویژگی لیست سیاه گفتگوها:</b></u> [فقط برای توسعه‌دهندگان]

جلوگیری از استفاده گفتگوهای نامطلوب از ربات.

/blacklistchat [شناسه گفتگو] : افزودن گفتگو به لیست سیاه.
/whitelistchat [شناسه گفتگو] : حذف گفتگو از لیست سیاه.
/blacklistedchat : نمایش لیست گفتگوهای موجود در لیست سیاه.
"""

HELP_5 = """
<u><b>مسدود کردن کاربران:</b></u> [فقط برای توسعه‌دهندگان]

شروع به نادیده گرفتن کاربر مسدود شده، به طوری که نمی‌تواند از دستورات ربات استفاده کند.

/block [نام کاربری یا پاسخ به کاربر] : مسدود کردن کاربر از استفاده ربات.
/unblock [نام کاربری یا پاسخ به کاربر] : رفع مسدودیت کاربر مسدود شده.
/blockedusers : نمایش لیست کاربران مسدود شده.
"""

HELP_6 = """
<u><b>دستورات پخش کانال:</b></u>

می‌توانید صدا/ویدیو را در کانال پخش کنید.

/cplay : شروع پخش فایل صوتی درخواستی در چت ویدیویی کانال.
/cvplay : شروع پخش فایل ویدیویی درخواستی در چت ویدیویی کانال.
/cplayforce یا /cvplayforce : توقف پخش فعلی و شروع پخش فایل درخواستی.

/channelplay [نام کاربری کانال یا شناسه آن] یا [غیرفعال] : اتصال کانال به گروه و شروع پخش فایل‌ها با استفاده از دستورات ارسالی در گروه.
"""

HELP_7 = """
<u><b>ویژگی مسدودیت سراسری</b></u> [فقط برای توسعه‌دهندگان]:

/gban [نام کاربری یا پاسخ به کاربر] : مسدود کردن سراسری کاربر از تمام گفتگوهای تحت پوشش و جلوگیری از استفاده از ربات.
/ungban [نام کاربری یا پاسخ به کاربر] : رفع مسدودیت سراسری کاربر مسدود شده.
/gbannedusers : نمایش لیست کاربران مسدود شده سراسری.
"""

HELP_8 = """
<b><u>تکرار پخش:</b></u>

<b>شروع به تکرار پخش فعلی در حلقه می‌کند</b>

/loop [فعال/غیرفعال] : فعال/غیرفعال کردن تکرار برای پخش فعلی
/loop [1, 2, 3, ...] : فعال کردن تکرار برای تعداد مشخص شده.
"""

HELP_9 = """
<u><b>حالت تعمیر و نگهداری</b></u> [فقط برای توسعه‌دهندگان]:

/logs : دریافت لاگ‌های ربات.
/logger [فعال/غیرفعال] : ربات شروع به ثبت فعالیت‌های رخ داده می‌کند.
/maintenance [فعال/غیرفعال] : فعال یا غیرفعال کردن حالت تعمیر و نگهداری ربات.
"""

HELP_10 = """
<b><u>پینگ و آمار:</b></u>

/start : راه‌اندازی ربات موسیقی.
/help : دریافت منوی راهنما با توضیح دستورات.
/ping : نمایش پینگ و آمار سیستم ربات.
/stats : نمایش آمار کامل ربات.
"""

HELP_11 = """
<u><b>دستورات پخش:</b></u>

<b>v:</b> برای پخش ویدیویی.
<b>force:</b> برای پخش اجباری.

/play یا /vplay : شروع پخش فایل درخواستی در چت ویدیویی.
/playforce یا /vplayforce : توقف پخش فعلی و شروع پخش فایل درخواستی.
"""

HELP_12 = """
<b><u>درهم کردن صف:</b></u>

/shuffle : درهم کردن آهنگ‌های موجود در صف.
/queue : نمایش صف درهم شده.
"""

HELP_13 = """
<b><u>جلو و عقب بردن پخش:</b></u>

/seek [مدت به ثانیه] : جلو بردن پخش به مدت مشخص شده.
/seekback [مدت به ثانیه] : عقب بردن پخش به مدت مشخص شده.
"""

HELP_14 = """
<b><u>دانلود آهنگ</b></u>

/song [نام آهنگ/لینک یوتیوب] : دانلود هر فایلی از یوتیوب به صورت MP3 یا MP4.
"""

HELP_15 = """
<b><u>دستورات سرعت:</b></u>

می‌توانید سرعت پخش فعلی را کنترل کنید. [فقط برای مدیران]

/speed یا /playback : برای تنظیم سرعت پخش صدا در گروه.
/cspeed یا /cplayback : برای تنظیم سرعت پخش صدا در کانال.
"""
